esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
/*
 *   Copyright 2020 Michael Hightower
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 */

/*
 * As far as I know, there is no way to get called for a Hardware WDT. I assume
 * it generates a form of reset that occurs at a low level that cannot be
 * trapped. Debugging an HWDT can be quite challenging.
 *
 * This module writes a stack dump to the serial port after a Hardware Watchdog
 * Timer has struck and a new boot cycle has begun. By making adjustments to the
 * stack, we can avoid crash stack data being overwritten by this tool,
 * the Boot ROM and the bootloader.
 *
 * We are using the method defined for `core_esp8266_app_entry_noextra4k.cpp` to
 * load an alternate `app_entry_redefinable()`. For details on this method, see
 * comments in `core_esp8266_main.cpp's app_entry()`.
 *
 * Using this alternate we can gain control before the SDK is started.
 * And dump what is left of the "sys" and "cont" stacks.
 *
 * By making some adjustments to start of the stack pointer, at the entry to
 * `app_entry_redefinable()`, and also to the stack pointer passed to the SDK,
 * we can preserve the stack during an HWDT event.
 *
 * To use, just place this file in the sketch directory before opening the
 * project and build and upload your sketch. That should be enough to get it
 * included in your sketch. If that does not work, then add a call to:
 *    `void enable_debug_hwdt_at_link_time (void);`
 * in `setup()`. This tool prints to the serial port at the default serial port
 * speed set by the boot ROM. On a Hardware WDT reset that port speed is
 * 115200 bps. If your needs differ, see the HWDT_UART_SPEED option below.
 *
 * When you get a stack dump, copy-paste it into the "ESP Exception Decoder".
 * Since we don't have a SP, we see a lot more stuff in the report. Start at the
 * bottom and work your way up. At this time I have not had a lot of practice
 * using this tool.  TODO: Update description with more details when available.
 *
 *
 *
 * Possible Issues/Thoughts/Improvements:
 *
 * I wonder if the eboot could be changed to use at stack pointer beginning at
 * 0x3fffeb30. This would allow for a value near 640 for ROM_STACK_SIZE.
 *
 * If a problem should arise with some data elements being corrupted during
 * reboot, would it be possible to move their DRAM location higher in memory.
 *
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*                          Configuration Options                             */
/*____________________________________________________________________________*/


/*
 * DEBUG_HWDT
 *
 * Enables this debug tool for printing a Hardware WDT stack dump on reboot.
 *
 */
 #define DEBUG_HWDT


/*
 * DEBUG_HWDT_NO4KEXTRA
 *
 * This option will leave more of the system stack available for the stack dump.
 * The problem with the "4K extra" option is that it pushes the system stack up
 * into the ROM's BSS area which gets zeroed at reboot by the Boot ROM.
 *
 * Using this option has the effect of taking 4K of DRAM away from the heap
 * which gets used for the "cont" stack. Leaving an extra 4K on the "sys" stack,
 * that is clear of the ROM's BSS area. This allows for a more complete "sys"
 * stack dump. The choice here can depend on where you are crashing.
 *
 * Because we don't know where the crash occurs, this option prints two stack
 * dumps. One for "cont" (user stack) and one for "sys" (NONOS SDK).
 *
 */
#define DEBUG_HWDT_NO4KEXTRA


/*
 * HWDT_UART_SPEED
 *
 * UART serial speed to be used for stack dump. On reboot the ESP8266 ROM
 * sets a speed of 115200 BPS. If you are using this default speed you can skip
 * this option and save the IRAM space.
 *
 */
 // #define HWDT_UART_SPEED (115200)


/*
 * HWDT_PRINT_GREETING
 *
 * Prints a simple introduction to let you know this tool is active and in the
 * build. At power-on this may not be viewable on some devices. The crystal
 * has to be 40Mhz for this to work w/o using the HWDT_UART_SPEED option above.
 * May not be worth the cost in IRAM.
 *
 * EDIT: There is something different in the UART setup after a flash upload. I
 * am unable to print using the same code that works for Power-on and an EXT_RST
 * at any other time. After the SDK has run a 2nd EXT_RST will show the greeting
 * message.
 *
 */
 // #define HWDT_PRINT_GREETING


/*
 * ROM_STACK_SIZE
 *
 * There are four sections of code that would normally share the same stack
 * space starting just before 0x40000000.
 *   1) The Boot ROM (uses around 640 bytes)
 *   2) The Bootloader, eboot.elf (uses around 720 bytes.)
 *   3) `app_entry_redefinable()` just before it starts the SDK.
 *   4) The NONOS SDK, optionally the Core when the extra 4K option is selected.
 *
 * To preserve the sketch stack data for a stack dump, I define three separate
 * stacks:
 *   1) Boot ROM and eboot
 *   2) this stack dump code
 *   3) SDK, Core, and Sketch
 *
 * With this, we can recover a complete stack trace of our failed sketch. To be
 * safe, I am leaving this at 1024; however, I think there is room to lower it
 * without loss of information.
 */
#ifndef ROM_STACK_SIZE
#define ROM_STACK_SIZE (1024)
#endif


/*
 * HWDT_INFO
 *
 * Gather some useful information on ROM and bootloader combined, sys, and cont
 * stack usage. If you are missing the include file for this structure, you can
 * copy-paste from an embeded version of the .h below.
 *
 */
 #define HWDT_INFO


