esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
/*
 * HWDT_OPTION_THE_OPTIMIST
 *
 * The optimist's choice. It can be used to reduce the IRAM footprint. It
 * assumes the strings in memory before the crash are still valid and can be
 * used for printing the report.
 *
 * EDIT: It appears I am mistaken. String constants appear to be loaded
 * at boot time and are available from the start before crt0 runs. I'll wait
 * for a reviewer confirmation before making this option a permanent selection.
 *
 */
 #define HWDT_OPTION_THE_OPTIMIST


/*
 * ROM_STACK_DUMP
 *
 * Dump the stack contents of the ROM Stack area. Good for getting a visual
 * on stack usage. Probably not of value beyond developing this tool.
 *
 #define ROM_STACK_DUMP
 */

/*
 * HWDT_IF_METHOD_RESET_REASON
 *
 * If statement vs switch method to implement the logic. Both can be made
 * smaller by removing confirmation checks.
 *
 * Checks are being performed when DEBUG_HWDT_DEBUG_RESET_REASON has been
 * defined.
 *
 #define DEBUG_HWDT_DEBUG_RESET_REASON
 */
 #define HWDT_IF_METHOD_RESET_REASON

/*____________________________________________________________________________*/
/*                                                                            */
/*                     End of Configuration Options                           */
/*____________________________________________________________________________*/


#ifdef DEBUG_HWDT

#include <c_types.h>
#include "cont.h"
#include "coredecls.h"
#include <core_esp8266_features.h>
#include <esp8266_undocumented.h>
#include <esp8266_peri.h>
#include <uart.h>

extern "C" {
#include <user_interface.h>
#include <uart_register.h>
extern void call_user_start();
extern uint32_t rtc_get_reset_reason(void);
}

// #define DEBUG_HWDT_DEBUG

#ifdef DEBUG_HWDT_DEBUG
/*
 * We have two copies of HWDT_INFO_t. Verify internal and external structures match.
 *
 * This duplication is done so that in most cases, a simple/quick add one file
 * to a sketch folder is enough to debug.
 *
 * Only if additional internal information is needed, would this include be
 * added. Since we have two copies, a static_assert is used to verify that at
 * least the the size of the two structures are the same.
 */
#include "hwdt_app_entry.h"
#endif

/*
 * Verify that the internal and external structure definitions match.
 */
#ifdef HWDT_STACK_DUMP_H
#define HWDT_INFO_t LOCAL_HWDT_INFO_t
#define hwdt_info LOCAL_hwdt_info
#endif

/*
 * If you are using the HWDT_INFO_t structure, and are missing the include file.
 * Copy-paste the include block below into its respective filename.
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*        Start of copy-paste block to create "hwdt_app_entry.h"              */
/*____________________________________________________________________________*/
#if !defined(HWDT_STACK_DUMP_H) || defined(HWDT_INFO_t)
#define HWDT_STACK_DUMP_H

typedef struct HWDT_INFO {
    uint32_t rom;
    uint32_t sys;
    uint32_t cont;
    uint32_t rtc_sys_reason;
    uint32_t rom_api_reason;
    uint32_t cont_integrity;
    uint32_t reset_reason;
    bool g_pcont_valid;
} HWDT_INFO_t;

void enable_debug_hwdt_at_link_time(void);

extern uint32_t *g_rom_stack;
extern HWDT_INFO_t hwdt_info;

#endif
/*____________________________________________________________________________*/
/*                                                                            */
/*        End of copy-paste block for creating "hwdt_app_entry.h"             */
/*____________________________________________________________________________*/


#ifdef HWDT_INFO_t
#undef HWDT_INFO_t
#undef hwdt_info
static_assert(sizeof(HWDT_INFO_t) == sizeof(LOCAL_HWDT_INFO_t), "Local and include verison of HWDT_INFO_t do not match.");
#endif


#define MK_ALIGN16_SZ(a) (((a) + 0x0F) & ~0x0F)
#define ALIGN_UP(a, s) ((decltype(a))((((uintptr_t)(a)) + (s-1)) & ~(s-1)))
#define ALIGN_DOWN(a, s) ((decltype(a))(((uintptr_t)(a)) & ~(s-1)))

#ifndef CONT_STACKGUARD
#define CONT_STACKGUARD 0xfeefeffe
#endif
constexpr volatile uint32_t *RTC_SYS = (volatile uint32_t*)0x60001100;


constexpr uint32_t *dram_start      = (uint32_t *)0x3FFE8000;
constexpr uint32_t *dram_end        = (uint32_t *)0x40000000;

constexpr uint32_t *rom_stack_first = (uint32_t *)0x40000000;
constexpr uint32_t *sys_stack       = (uint32_t *)0x3fffeb30;
/*
 * The space between 0x3fffe000 up to 0x3fffeb30 is a ROM BSS area that is later
 * claimed by the SDK for stack space. This is a problem area for stack dump,
 * because the ROM BSS gets zeroed as part of ROM init on reboot. Any part of
 * the "sys" stack residing there is lost. On the other hand, it becomes a prime
 * candidate for DRAM address space to handle the needs of this stack dump
 * utility.
 */
constexpr uint32_t *sys_stack_e000  = (uint32_t *)0x3fffe000;

// Map out who will live where.
constexpr size_t rom_stack_A16_sz = MK_ALIGN16_SZ(ROM_STACK_SIZE);
constexpr size_t cont_stack_A16_sz = MK_ALIGN16_SZ(sizeof(cont_t));
constexpr uint32_t *rom_stack = (uint32_t *)((uintptr_t)rom_stack_first - rom_stack_A16_sz);


#ifdef DEBUG_HWDT_NO4KEXTRA
/* This is the default NONOS-SDK user's heap location for NO4KEXTRA */
static cont_t g_cont __attribute__ ((aligned (16)));
constexpr uint32_t *sys_stack_first = (uint32_t *)((uintptr_t)rom_stack);

#else
constexpr uint32_t *cont_stack_first = (uint32_t *)((uintptr_t)rom_stack); // only for computation
constexpr cont_t *cont_stack = (cont_t *)((uintptr_t)cont_stack_first - cont_stack_A16_sz);
constexpr uint32_t *sys_stack_first = (uint32_t *)((uintptr_t)cont_stack);
#endif

uint32_t *g_rom_stack  __attribute__((section(".noinit")));
size_t g_rom_stack_A16_sz  __attribute__((section(".noinit")));
HWDT_INFO_t hwdt_info __attribute__((section(".noinit")));

void enable_debug_hwdt_at_link_time(void)
{
    /*
     * This function does nothing; however, including a call to it in setup,
     * allows this module to override, at link time, the core_esp8266_main.cpp's
     * `app_entry()` with the one below. This will create a stack dump on
     * Hardware WDT resets.
     *
     * It appears just including this module in the sketch directory before
     * opening the project is enough. However, just play it safe, call this
     * function from setup.
     */
}


/* the following code is linked only if a call to the above function is made somewhere */

