esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
extern "C" {
#if 0 // Handy debug print during development
static void ICACHE_RAM_ATTR print_size(uintptr_t val) {
    uint32_t fmt_sz[4];
    fmt_sz[0]  = ('0' ) | ('x' <<8) | ('%' <<16) | ('0' <<24);
    fmt_sz[1]  = ('8' ) | ('X' <<8) | (',' <<16) | (' ' <<24);
    fmt_sz[2]  = (' ' ) | ('%' <<8) | ('5' <<16) | ('u' <<24);
    fmt_sz[3]  = ('\n') | ('\0'<<8) | ('\0'<<16) | ('\0'<<24);
    ets_printf((const char *)fmt_sz, val, val);
}
#endif


enum PRINT_STACK {
    CONT = 1,
    SYS = 2,
    ROM = 4
};

#if defined(HWDT_OPTION_THE_OPTIMIST)
static void ICACHE_RAM_ATTR print_stack(uintptr_t start, uintptr_t end, uint32_t chunk) {
    ets_printf("\n>>>stack>>>\n\nctx: ");

    if (chunk & PRINT_STACK::CONT) {
        ets_printf("cont");
    } else
    if (chunk & PRINT_STACK::SYS) {
        ets_printf("sys");
    } else
    if (chunk & PRINT_STACK::ROM) {
        ets_printf("ROM");
    }

    ets_printf("\nsp: %08x end: %08x offset: %04x\n", start, end, 0);

    size_t this_mutch = end - start;
    if (this_mutch >= 0x10) {
        for (size_t pos = 0; pos < this_mutch; pos += 0x10) {
            uint32_t *value = (uint32_t *)(start + pos);

            // rough indicator: stack frames usually have SP saved as the second word
            bool looksLikeStackFrame = (value[2] == (start + pos + 0x10));
            ets_printf("%08x:  %08x %08x %08x %08x %c\n", (uint32_t)&value[0],
                       value[0], value[1], value[2], value[3],
                       (looksLikeStackFrame)?'<':' ');
        }
    }

    ets_printf("<<<stack<<<\n");
}

#else
static void ICACHE_RAM_ATTR print_stack(uintptr_t start, uintptr_t end, uint32_t chunk) {

    uint32_t fmt_stk[6];
    fmt_stk[0] = ('\n') | ('>' <<8) | ('>' <<16) | ('>' <<24);
    fmt_stk[1] = ('s' ) | ('t' <<8) | ('a' <<16) | ('c' <<24);
    fmt_stk[2] = ('k' ) | ('>' <<8) | ('>' <<16) | ('>' <<24);
    fmt_stk[3] = ('\n') | ('\n'<<8) | ('c' <<16) | ('t' <<24);
    fmt_stk[4] = ('x' ) | (':' <<8) | (' ' <<16) | ('%' <<24);
    fmt_stk[5] = ('s' ) | ('\n'<<8) | ('\0'<<16) | ('\0'<<24);

    uint32_t fmt_sp[9];
    fmt_sp[0]  = ('s' ) | ('p' <<8) | (':' <<16) | (' ' <<24);
    fmt_sp[1]  = ('%' ) | ('0' <<8) | ('8' <<16) | ('x' <<24);
    fmt_sp[2]  = (' ' ) | ('e' <<8) | ('n' <<16) | ('d' <<24);
    fmt_sp[3]  = (':' ) | (' ' <<8) | ('%' <<16) | ('0' <<24);
    fmt_sp[4]  = ('8' ) | ('x' <<8) | (' ' <<16) | ('o' <<24);
    fmt_sp[5]  = ('f' ) | ('f' <<8) | ('s' <<16) | ('e' <<24);
    fmt_sp[6]  = ('t' ) | (':' <<8) | (' ' <<16) | ('%' <<24);
    fmt_sp[7]  = ('0' ) | ('4' <<8) | ('x' <<16) | ('\n'<<24);
    fmt_sp[8]  = ('\0') | ('\0'<<8) | ('\0'<<16) | ('\0'<<24);

    uint32_t fmt_rom[1];
    fmt_rom[0]  = ('R' ) | ('O' <<8) | ('M' <<16) | ('\0'<<24);

    uint32_t fmt_sys[1];
    fmt_sys[0]  = ('s' ) | ('y' <<8) | ('s' <<16) | ('\0'<<24);

    uint32_t fmt_cont[2];
    fmt_cont[0] = ('c' ) | ('o' <<8) | ('n' <<16) | ('t' <<24);
    fmt_cont[1] = ('\0') | ('\0'<<8) | ('\0'<<16) | ('\0'<<24);

    if (chunk & PRINT_STACK::CONT) {
        ets_printf((const char *)fmt_stk, (const char *)fmt_cont);
    } else
    if (chunk & PRINT_STACK::SYS) {
        ets_printf((const char *)fmt_stk, (const char *)fmt_sys);
    } else
    if (chunk & PRINT_STACK::ROM) {
        ets_printf((const char *)fmt_stk, (const char *)fmt_rom);
    }

    ets_printf((const char *)fmt_sp, start, end, 0);

    {
        uint32_t fmt_stk_dmp[8];
        fmt_stk_dmp[0] = ('%') | ('0' <<8) | ('8' <<16) | ('x' <<24);
        fmt_stk_dmp[1] = (':') | (' ' <<8) | (' ' <<16) | ('%' <<24);
        fmt_stk_dmp[2] = ('0') | ('8' <<8) | ('x' <<16) | (' ' <<24);
        fmt_stk_dmp[3] = ('%') | ('0' <<8) | ('8' <<16) | ('x' <<24);
        fmt_stk_dmp[4] = (' ') | ('%' <<8) | ('0' <<16) | ('8' <<24);
        fmt_stk_dmp[5] = ('x') | (' ' <<8) | ('%' <<16) | ('0' <<24);
        fmt_stk_dmp[6] = ('8') | ('x' <<8) | (' ' <<16) | ('%' <<24);
        fmt_stk_dmp[7] = ('c') | ('\n'<<8) | ('\0'<<16) | ('\0'<<24);

        size_t this_mutch = end - start;
        if (this_mutch >= 0x10) {
            for (size_t pos = 0; pos < this_mutch; pos += 0x10) {
                uint32_t *value = (uint32_t *)(start + pos);

                // rough indicator: stack frames usually have SP saved as the second word
                bool looksLikeStackFrame = (value[2] == (start + pos + 0x10));
                ets_printf((const char*)fmt_stk_dmp, (uint32_t)&value[0],
                           value[0], value[1], value[2], value[3],
                           (looksLikeStackFrame)?'<':' ');
            }
        }
    }
    {
        uint32_t fmt_stk_end[4];
        fmt_stk_end[0] = ('<' ) | ('<' <<8) | ('<' <<16) | ('s' <<24);
        fmt_stk_end[1] = ('t' ) | ('a' <<8) | ('c' <<16) | ('k' <<24);
        fmt_stk_end[2] = ('<' ) | ('<' <<8) | ('<' <<16) | ('\n'<<24);
        fmt_stk_end[3] = ('\n') | ('\0'<<8) | ('\0'<<16) | ('\0'<<24);
        ets_printf((const char *)fmt_stk_end);
    }
}
#endif

static const uint32_t * ICACHE_RAM_ATTR skip_stackguard(const uint32_t *start, const uint32_t *end, const uint32_t pattern) {
    // Find the end of SYS stack activity
    const uint32_t *uptr = start;

    size_t this_mutch = (uintptr_t)end - (uintptr_t)start;
    this_mutch /= sizeof(uint32_t);
    size_t i = 0;
    for (; i < this_mutch; i++) {
        if (pattern != uptr[i]) {
            i &= ~3U;
            uptr = &uptr[i];
            break;
        }
    }
    if (i == this_mutch) {
        uptr = &uptr[i];
    }

    return uptr;
}

static void ICACHE_RAM_ATTR check_g_pcont_validity(void) {
    /*
     * Testing of vital pointers for validity could also aid as a partial
     * indicator of power-on. Not needed for that purpose at this time.
     */
    if (g_rom_stack == rom_stack &&
        g_rom_stack_A16_sz == rom_stack_A16_sz &&
#ifdef DEBUG_HWDT_NO4KEXTRA
        g_pcont == &g_cont
#else
        g_pcont == cont_stack
#endif
        ) {
            hwdt_info.g_pcont_valid = true;
    } else {
        hwdt_info.g_pcont_valid = false;
        g_rom_stack = rom_stack;
        g_rom_stack_A16_sz = rom_stack_A16_sz;
    }
}

#if defined(DEBUG_HWDT_DEBUG) || defined(DEBUG_HWDT_DEBUG_RESET_REASON)
#ifndef DEBUG_HWDT_DEBUG_RESET_REASON
#define DEBUG_HWDT_DEBUG_RESET_REASON
#endif
#define debug__confirm_rom_reason(a) ((a) == rom_api_reason)
#else
#define debug__confirm_rom_reason(a) (true)
#endif

typedef enum ROM_RST_REASON { /* Comments on the right are from RTOS SDK */
  NO_MEAN                =  0,    /* Undefined */
  POWERON_RESET          =  1,    /* Power on boot      *//**<1, Vbat power on reset */
  EXT_RESET              =  2,    /* External reset or wake-up from Deep-sleep */
                                                          /**<2, external system reset */
  SW_RESET               =  3,    /*                    *//**<3, Software reset digital core */
  OWDT_RESET             =  4,    /* Hardware WDT reset *//**<4, Legacy watch dog reset digital core */
  DEEPSLEEP_RESET        =  5,    /*                    *//**<5, Deep Sleep reset digital core */
  SDIO_RESET             =  6,    /*                    *//**<6, Reset by SLC module, reset digital core*/
} ROM_RST_REASON_t;

static uint32_t ICACHE_RAM_ATTR get_reset_reason(bool* power_on, bool* hwdt_reset) {
    /*
     * Detecting a Hardware WDT (HWDT) reset is a little complicated at boot
     * before the SDK is started.
     *
     * While the ROM API will report an HWDT, it does not change the status
     * after a software restart. And the SDK has not been started so its API is
     * not available.
     *
     * There is a value in System RTC memory that appears to store, at restart,
     * the reset reason for the SDK. I assume it is set by SDK before the
     * restart. Of course, this value is invalid at power on before the SDK
     * runs. It is set to 0 by the SDK after init and later is changed to a 1
     * and remains 1 during the operation of the sketch. So during normal
     * execution the reason is preset to indicate a Hardware WDT reset.
     *
     * This case list for example and not comprehensive.
     *
     * Case 1: At power-on boot the ROM API result is valid; however, the SDK
     * value in RTC Memory has not been set at this time.
     *
     * Case 2: A HWDT reset has occurred, which is later followed with a
     * restart by the SDK. At boot, the ROM API result still reports the HWDT
     * reason.
     *
     * Case 3: It is pssible to see a value of 0 or 1 (power-on or HWDT) for the
     * SDK reset reason for both EXT_RST and Hardware WDT resets. For either of
     * these values, the ROM API does hold the valid reset reason.
     *
     * I need to know if this is the 1st boot at power on. Combining these
     * indicators has been tricky, I think I now have it.
     *
     */

    uint32_t rtc_sys_reason = hwdt_info.rtc_sys_reason = RTC_SYS[0];
    hwdt_info.rom_api_reason = rtc_get_reset_reason();
    ROM_RST_REASON_t rom_api_reason = (ROM_RST_REASON_t)hwdt_info.rom_api_reason;

#ifdef HWDT_IF_METHOD_RESET_REASON
    *hwdt_reset = false;
    *power_on = false;
    /*
     * This logic takes the reason left in memory by the SDK as an initial
     * estimate and expands on it.
     */
    hwdt_info.reset_reason = rtc_sys_reason;
    if (REASON_WDT_RST == rtc_sys_reason) {
        if (OWDT_RESET == rom_api_reason) {
            *hwdt_reset = true;
        } else {
            hwdt_info.reset_reason = REASON_EXT_SYS_RST;
            if (!debug__confirm_rom_reason(EXT_RESET)) {
                hwdt_info.reset_reason = ~0;
            }
        }

    } else if (REASON_DEFAULT_RST == rtc_sys_reason) {
        /*
         * 1) The 0 value (REASON_DEFAULT_RST) shows up with multiple EXT_RSTs
         *    quickly. The 1 value (REASON_WDT_RST), previous if, shows up if
         *    you wait a while before the EXT_RST.
         * 2) The 0 value also shows up if a HWDT reset occurs too quickly after
         *    the system starts. Note even the SDK gets this one right.
         */
        if (OWDT_RESET == rom_api_reason) {
             *hwdt_reset = true;
             hwdt_info.reset_reason = REASON_WDT_RST;
        } else {
             hwdt_info.reset_reason = REASON_EXT_SYS_RST;
             if (!debug__confirm_rom_reason(EXT_RESET)) {
               hwdt_info.reset_reason = ~0;
             }
        }

    } else if (REASON_EXT_SYS_RST < rtc_sys_reason) {
        /*
         * We only want to indicate power-on, if the ROM API reason confirms it.
         * A reliable power-on indicator is need for set_uart_speed() to work
         * properly.
         */
        *power_on = true;
        hwdt_info.reset_reason = REASON_DEFAULT_RST;
        if (!debug__confirm_rom_reason(POWERON_RESET)) {
            hwdt_info.reset_reason = ~0;
            *power_on = false;
        }
    }
#else
    // New reset reason logic test
    *hwdt_reset = false;
    *power_on = false;
    switch(rtc_sys_reason) {
        case REASON_DEFAULT_RST:
          /*
           * This can be present for REASON_EXT_SYS_RST or REASON_WDT_RST
           * The rtc_sys_reason starts off at 0 and is set to 1 later,
           * if crash occurs before set, then it is still 0.
           */
        case REASON_WDT_RST:
          /*
           * This may be present for REASON_EXT_SYS_RST or REASON_WDT_RST,
           * use rom_api_reason to confirm.
           */
          if (OWDT_RESET == rom_api_reason) {
              hwdt_info.reset_reason = REASON_WDT_RST;
              *hwdt_reset = true;
          } else if (!debug__confirm_rom_reason(EXT_RESET)) {
              hwdt_info.reset_reason = ~0;
          } else {
              hwdt_info.reset_reason = REASON_EXT_SYS_RST;
          }
          break;
        /* These should be correct as is */
        case REASON_EXCEPTION_RST:
        case REASON_SOFT_WDT_RST:
        case REASON_SOFT_RESTART:
        case REASON_DEEP_SLEEP_AWAKE:    // TODO: Untested.
            hwdt_info.reset_reason = rtc_sys_reason;
            break;
        /*
         * REASON_EXT_SYS_RST is not expected at reboot, let it fall though to
         * default for confirmation.
         */
        case REASON_EXT_SYS_RST:
        default:
            /*
             * Out of range value, this could be a REASON_DEFAULT_RST,
             * use rom_api_reason to confirm.
             */
            if (POWERON_RESET == rom_api_reason) {
                hwdt_info.reset_reason = REASON_DEFAULT_RST;
                *power_on = true;
            } else if (!debug__confirm_rom_reason(EXT_RESET)) {
                hwdt_info.reset_reason = ~0;
            } else {
                hwdt_info.reset_reason = REASON_EXT_SYS_RST;
            }
            break;
    }
#endif
    return hwdt_info.reset_reason;
}

#ifdef HWDT_UART_SPEED
/*
 * We need this because the SDK has an override on this already. If we call it
 * at this time we will crash in the unintialized SDK.
 */
#ifndef ROM_uart_div_modify
#define ROM_uart_div_modify         0x400039d8
#endif
typedef int (*fp_uart_div_modify_t)(uint32_t uart_no, uint32 DivLatchValue);
constexpr fp_uart_div_modify_t real_uart_div_modify = (fp_uart_div_modify_t)ROM_uart_div_modify;


